app/controllers/accounts_controller.rb

  def transfer
    if request.post?
      begin
        @account.transfer(params[:amount], Account.find(params[:recipient]))
        flash[:notice] = t(:successful_transfer)
      rescue Exception => e
        flash[:error] = e.message
      end

      redirect_to :action => :index and return
    end

    @recipients = current_user.accounts.where(["id != ?", @account.id])
---
SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`user_id` = 19